clear; clc;

%% Сист. погрешности

    % ПУС---------------------------------------------
    w = [0 0 0]';

    % M
    n = rand(1, 3) * (0.05 - 0);

    M = [
            0 -n(2) n(1);
            n(2) 0 -n(3);
           -n(1) n(3)  0
        ];

    % del_K
    del_K = diag(  rand(1, 3) * (2 - 1)  );

    % eps
    eps = rand(3, 1) * (0.04 - 0);

    % del_w_s
    del_w_s = 10^-2 * del_K * w  -  M * w  +  eps


    % ПЛУ---------------------------------------------
    n = [0 9.81 0]';

    % M
    fi = rand(1, 3) * (0.02 - 0);

    M = [
            0 -fi(2) fi(1);
            fi(2) 0 -fi(3);
           -fi(1) fi(3)  0
        ];

    % del_K
    del_K = diag(   rand(1, 3) * (2 - 1)   );

    % del_a
    del_a = rand(3, 1) * (0.02 - 0);

    % del_a_s
    del_a_s = 10^-2 * del_K * n  -  M * n  +  del_a

    
%% Случайные погрешности

    Ts = 0.01;
    
    % Блуждание угла (лин. скорости)
        % ПУС
        ARW = 0.00520;
        sig_arw = ARW / sqrt(Ts)
        
        % ПЛУ
        VRW = 0.00418;
        sig_vrw = VRW / sqrt(Ts)
        
        
    % Случайное блуждание угл. скорости (лин. ускорения)
        % ПУС
        RRW  = 0.00110;
        sig_rrw = RRW / sqrt(Ts)
        
        % ПЛУ
        LARW = 0.00114;
        sig_larw = LARW / sqrt(Ts)
   